{
    "Header": {
        "title": "Hydraulic Engineering, Design, Manufacture & Service",
        "paragraph": "At Hydra Power Engineering Services, we harness the power of hydraulic technology to deliver cutting-edge solutions across various sectors. We merge top-notch engineering, design, and manufacturing with unparalleled customer service to bring you the best in hydraulic systems."
    },
    "About": {
        "paragraph": "Hydra Power Engineering Services Sdn. Bhd., in operation since 1994, offers premium hydraulic services to sectors including construction, offshore, agricultural, mobile, and industrial. Specializing in the design and manufacturing of hydraulic mechanical equipment, our expertise spans hydraulic cylinder fabrication, gear manufacturing, and various machining works. In addition to these, we handle steel fabrication tasks for diverse applications. Leveraging our two decades of experience, advanced facilities, and highly skilled staff, we deliver high-quality products, rapid response, punctual deliveries, and competitive pricing. Our primary commitment is to meet customers' needs and ensure their satisfaction, earning their trust to continually serve their business.",
        "Why": [
            "Two decades of proven industry experience",
            "Expertise in diverse hydraulic and machining tasks",
            "Consistently high-quality product delivery",
            "Flexible and rapid response to customer needs"
        ],
        "Why2": [
            "Advanced, state-of-the-art facilities and equipment",
            "Highly skilled and dedicated staff",
            "Competitive pricing without compromising on quality",
            "Strong commitment to punctuality and reliable deliveries"
        ]
    },

    "Portfolio": [
        {
            "title": "Project Title",
            "image": "img/portfolio/01-large.jpg"
        },
        {
            "title": "Project Title",
            "image": "img/portfolio/02-large.jpg"
        },
        {
            "title": "Project Title",
            "image": "img/portfolio/03-large.jpg"
        },
        {
            "title": "Project Title",
            "image": "img/portfolio/04-large.jpg"
        },
        {
            "title": "Project Title",
            "image": "img/portfolio/05-large.jpg"
        },
        {
            "title": "Project Title",
            "image": "img/portfolio/06-large.jpg"
        },
        {
            "title": "Project Title",
            "image": "img/portfolio/07-large.jpg"
        },
        {
            "title": "Project Title",
            "image": "img/portfolio/08-large.jpg"
        },
        {
            "title": "Project Title",
            "image": "img/portfolio/09-large.jpg"
        }
    ],
    "Services": [
        {
            "img": "img/servicesimg/mill.jpg",
            "name": "Fabrication",
            "text": "Our fabrication service is second to none. With our skilled team and state-of-the-art facilities, we handle steel fabrication tasks for diverse applications, ensuring durability and precision in each product we create."
        },
        {
            "img": "img/servicesimg/milling.jpg",
            "name": "Milling",
            "text": "Our milling service delivers intricately designed and carefully manufactured components. We use the latest milling machines to bring your designs to life with extreme accuracy and quality."
        },
        {
            "img": "img/servicesimg/pipes.jpg",
            "name": "Hydraulic Cylinder Manufacturing",
            "text": "With years of expertise, we manufacture hydraulic cylinders tailored to your specific needs. Our high-quality cylinders are designed to deliver superior performance and longevity in various operating environments."
        },
        {
            "img": "img/servicesimg/gear.jpg",
            "name": "Gear Manufacturing",
            "text": "Our gear manufacturing services provide highly precise and durable gears designed for a wide range of applications. We use advanced technologies to ensure optimal functionality and prolonged service life."
        },
        {
            "img": "img/servicesimg/design.jpg",
            "name": "Design & Prototyping",
            "text": "We offer comprehensive design and prototyping services to bring your hydraulic equipment ideas to reality. Our engineers work closely with clients to develop efficient and innovative solutions that meet their needs."
        },
        {
            "img": "img/servicesimg/maintenance.jpg",
            "name": "Maintenance & Repair",
            "text": "We understand the importance of minimizing downtime. That’s why we offer rapid and reliable maintenance and repair services, ensuring your hydraulic systems operate efficiently and trouble-free."
        }
    ],
    "Clients": [
        {
            "img": "img/testimonials/01.jpg",
            "text": "Hydra Power Engineering Services has been our go-to provider for hydraulic solutions. Their superior design and manufacturing capabilities are simply unmatched. The team is always ready to respond promptly and ensure punctual deliveries.",
            "name": "John Doe, Construction Sector"
        },
        {
            "img": "img/testimonials/02.jpg",
            "text": "We have been working with Hydra Power Engineering Services since 2005. Their top-notch engineering and commitment to customer service have made them a reliable partner for our offshore projects. They always meet our needs and ensure our satisfaction.",
            "name": "Johnathan Doe, Offshore Sector"
        },
        {
            "img": "img/testimonials/03.jpg",
            "text": "In the agricultural sector, efficiency and reliability are critical. Hydra Power Engineering Services provides us with high-quality hydraulic systems that we can count on. Their high level of expertise and professionalism is truly appreciated.",
            "name": "John Doe, Agricultural Sector"
        },
        {
            "img": "img/testimonials/04.jpg",
            "text": "Hydra Power Engineering Services consistently delivers top-quality products. Their attention to detail, punctuality, and competitive pricing set them apart in the mobile and industrial sector. Their work on our hydraulic mechanical equipment has been stellar.",
            "name": "Johnathan Doe, Mobile & Industrial Sector"
        },
        {
            "img": "img/testimonials/05.jpg",
            "text": "Working with Hydra Power Engineering Services has been a great experience. Their expertise in hydraulic cylinder fabrication, gear manufacturing, and machining works has significantly benefited our business. They have a highly skilled team that always delivers on time.",
            "name": "John Doe, Hydraulic Equipment Manufacturing"
        },
        {
            "img": "img/testimonials/06.jpg",
            "text": "Hydra Power Engineering Services is an expert in steel fabrication tasks for diverse applications. They always ensure high-quality products and their customer service is always excellent. Their commitment to meeting customer needs is evident in every project they undertake.",
            "name": "Johnathan Doe, Steel Fabrication Sector"
        }
    ],
    "Team": [
        {
            "img": "img/team/01.jpg",
            "name": "John Doe",
            "job": "Director"
        },
        {
            "img": "img/team/02.jpg",
            "name": "Mike Doe",
            "job": "Senior Designer"
        },
        {
            "img": "img/team/03.jpg",
            "name": "Jane Doe",
            "job": "Senior Designer"
        },
        {
            "img": "img/team/04.jpg",
            "name": "Karen Doe",
            "job": "Project Manager"
        }
    ],
    "Contact": {
        "address": " Jalan Piasau, Piasau, 98000 Miri, Sarawak, Malaysia",
        "phone": "+60 85-655 431",
        "email": "info@company.com",
        "facebook": "fb.com",
        "twitter": "twitter.com",
        "youtube": "youtube.com"
    }
}
